{
    "sections": [
        {
            "id": 1,
            "title": "Introduction to Yoga",
            "content": "Yoga is an ancient practice that originated in India over 5,000 years ago. It combines physical postures, breathing techniques, and meditation to promote physical, mental, and spiritual well-being.",
            "image": "https://example.com/yoga-intro.jpg",
            "key_points": [
                "Yoga means 'union' in Sanskrit",
                "It's more than just physical exercise",
                "Suitable for all ages and fitness levels"
            ]
        },
        {
            "id": 2,
            "title": "Basic Yoga Poses",
            "content": "These fundamental poses form the foundation of your yoga practice. Start with these to build strength, flexibility, and body awareness.",
            "poses": [
                {
                    "name": "Mountain Pose (Tadasana)",
                    "description": "Stand tall with feet together, arms at sides. Ground through your feet and lengthen your spine.",
                    "benefits": "Improves posture, strengthens thighs, knees, and ankles",
                    "image": "https://example.com/mountain-pose.jpg"
                },
                {
                    "name": "Tree Pose (Vrksasana)",
                    "description": "Stand on one leg, place the other foot on your inner thigh or calf, and bring hands to prayer position.",
                    "benefits": "Improves balance, strengthens legs and core",
                    "image": "https://example.com/tree-pose.jpg"
                },
                {
                    "name": "Warrior I (Virabhadrasana I)",
                    "description": "Step one foot back, bend front knee, and raise arms overhead with palms facing each other.",
                    "benefits": "Strengthens legs, opens hips, builds stamina",
                    "image": "https://example.com/warrior-pose.jpg"
                },
                {
                    "name": "Child's Pose (Balasana)",
                    "description": "Kneel on the floor, sit back on your heels, and fold forward with arms extended.",
                    "benefits": "Relaxes the back, hips, and mind",
                    "image": "https://example.com/child-pose.jpg"
                },
                {
                    "name": "Downward-Facing Dog (Adho Mukha Svanasana)",
                    "description": "Start on hands and knees, lift hips up and back, forming an inverted V shape.",
                    "benefits": "Strengthens arms and legs, lengthens spine, improves circulation",
                    "image": "https://example.com/downward-dog.jpg"
                }
            ]
        },
        {
            "id": 3,
            "title": "Breathing Techniques",
            "content": "Breathing is the foundation of yoga practice. These techniques help calm the mind, reduce stress, and increase energy.",
            "techniques": [
                {
                    "name": "Ujjayi Breath",
                    "description": "Breathe in and out through the nose, constricting the back of the throat to create a soft ocean-like sound.",
                    "benefits": "Calms the mind, builds heat in the body",
                    "instructions": "Inhale deeply through the nose, then exhale slowly through the nose while constricting the back of the throat"
                },
                {
                    "name": "Box Breathing",
                    "description": "Breathe in a square pattern: inhale, hold, exhale, hold, each for the same count.",
                    "benefits": "Reduces stress, improves focus",
                    "instructions": "Inhale for 4 counts, hold for 4 counts, exhale for 4 counts, hold for 4 counts"
                },
                {
                    "name": "Alternate Nostril Breathing",
                    "description": "Alternate breathing through each nostril while closing the other.",
                    "benefits": "Balances energy, calms the nervous system",
                    "instructions": "Close right nostril, inhale through left, close left, exhale through right, then reverse"
                }
            ]
        },
        {
            "id": 4,
            "title": "Yoga for Beginners",
            "content": "Starting a yoga practice doesn't require special equipment or extensive training. Here are some tips to help you begin your journey.",
            "tips": [
                {
                    "title": "Start with the Basics",
                    "content": "Begin with simple poses and gradually progress to more challenging ones as your body becomes stronger and more flexible."
                },
                {
                    "title": "Listen to Your Body",
                    "content": "Yoga should never cause pain. If a pose feels uncomfortable, modify it or skip it entirely."
                },
                {
                    "title": "Focus on Your Breath",
                    "content": "Your breath is your guide. Breathe deeply and evenly throughout your practice."
                },
                {
                    "title": "Be Consistent",
                    "content": "Even a short daily practice is more beneficial than occasional longer sessions."
                },
                {
                    "title": "Use Props",
                    "content": "Blocks, straps, and blankets can help you achieve proper alignment and make poses more accessible."
                }
            ]
        },
        {
            "id": 5,
            "title": "Yoga Etiquette",
            "content": "Understanding basic yoga etiquette helps create a respectful and harmonious environment for everyone.",
            "guidelines": [
                "Arrive on time or early to class",
                "Remove your shoes before entering the studio",
                "Turn off your phone",
                "Be mindful of personal space",
                "Stay for the entire class if possible",
                "Clean up after yourself",
                "Be respectful of others' practice"
            ]
        }
    ]
} 